---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.PartType
source: html/e26cf700-7e87-1c25-061f-1601fe719cce.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.PartType Property

The part type of the pipe fitting or pipe accessory.

## Syntax (C#)
```csharp
public PartType PartType { get; }
```